<?php
/**
 +----------------------------------------------------------
 * 批量上传订单
 +----------------------------------------------------------
 * detail:
 +----------------------------------------------------------
 * TIME:2018-03-05 09:03:44
 +----------------------------------------------------------
 * author:wythe(汪志虹)
 +----------------------------------------------------------
 */
namespace Order\Controller;
use Common\Controller\CommonController;
class UploadOrderController extends CommonController{
	/*
	 +----------------------------------------------------------
	 *首页展示页
	 +----------------------------------------------------------
	 * @param  void;
	 +----------------------------------------------------------
	 * @return view
	 +----------------------------------------------------------
	*/
	public function index(){
		$this->display();
	}

	/*
	 +----------------------------------------------------------
	 * 首页ajax获取数据页
	 +----------------------------------------------------------
	 * @param  ;
	 +----------------------------------------------------------
	 * @return json{rows:array,count:int}
	 +----------------------------------------------------------
	*/
	public function XHRIndex(){
		$postData  = I('post.');
		$return = D('Awb')->createOrderForTransportMode($postData);
		$this->ajaxReturn($return);
		//$this->ajaxReturn(ReturnData(true,'','测试CNB12345678',$postData));
	}
	/*
	 +----------------------------------------------------------
	 * 获取渠道代码列表
	 +----------------------------------------------------------
	 * @param  ;
	 +----------------------------------------------------------
	 * @return json{status:bool,msg:string,data:mix,code:int}
	 +----------------------------------------------------------
	*/
	public function getTransportMode(){
		$res = D('Order/CountryCode')->getTransportModeList();
		$return = array();
		foreach ($res as $key => $val) {
			$return[$val['transportMode']] = $val;
		}
		$this->ajaxReturn($return);
	}

	/*
	 +----------------------------------------------------------
	 * 空操作，用于前端异步
	 +----------------------------------------------------------
	 * @param  ;
	 +----------------------------------------------------------
	 * @return json{status:bool,msg:string,data:mix,code:int}
	 +----------------------------------------------------------
	*/
	public function emptyAjax(){}
}