<?php
/**
 +----------------------------------------------------------
 * CLI模式公共类
 +----------------------------------------------------------
 * detail:
 +----------------------------------------------------------
 * TIME:2018-01-18 15:35:45
 +----------------------------------------------------------
 * author:wythe(汪志虹)
 +----------------------------------------------------------
 */
namespace CliHandle\Controller;
use Think\Controller;
class CommonController extends Controller{
	/*
	 +----------------------------------------------------------
	 * 定义输出函数
	 +----------------------------------------------------------
	 * @param  ;
	 +----------------------------------------------------------
	 * @return view string
	 +----------------------------------------------------------
	*/
	public function printMsg($msg,$type='process',$sign=''){	
		if($type=='start'){
			echo 'TIME:'.date('Y-m-d H:i:s').'-----'.$msg.'-----START'."\r\n";
		}elseif($type=="process"){
			echo 'TIME:'.date('Y-m-d H:i:s').'--[PROCESS '.$sign.']--[MSG:'.$msg."]\r\n";
		}elseif($type=="end"){
			echo 'TIME:'.date('Y-m-d H:i:s').'-----'.$msg.'-----END'."\r\n";
		}
	}

}